Clash Bot Workflow Prerequisites - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Prerequisite Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.lambda_bucket.data.aws_caller_identity.current: Reading...
module.lambda_bucket.data.aws_partition.current: Reading...
module.lambda_bucket.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.lambda_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=clash-bot-lambda-bucket-development]
module.lambda_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 1s [id=816923827429]
module.lambda_bucket.data.aws_caller_identity.current: Read complete after 1s [id=816923827429]
module.lambda_bucket.data.aws_canonical_user_id.this[0]: Read complete after 1s [id=0948928f0870858bf04a47374e9461e99c48fdaccd7bdc61bb4f3f2515ee6cfc]
module.lambda_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=clash-bot-lambda-bucket-development]
module.lambda_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=clash-bot-lambda-bucket-development]
module.lambda_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=clash-bot-lambda-bucket-development]
module.lambda_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=clash-bot-lambda-bucket-development,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_bucket.aws_s3_bucket.this[0] must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::clash-bot-lambda-bucket-development" -> (known after apply)
      ~ bucket                      = "clash-bot-lambda-bucket-development" -> "-development" # forces replacement
      ~ bucket_domain_name          = "clash-bot-lambda-bucket-development.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "clash-bot-lambda-bucket-development.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "clash-bot-lambda-bucket-development" -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "0948928f0870858bf04a47374e9461e99c48fdaccd7bdc61bb4f3f2515ee6cfc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.lambda_bucket.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "clash-bot-lambda-bucket-development" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "clash-bot-lambda-bucket-development,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "dpatposs" -> null
                  - id           = "0948928f0870858bf04a47374e9461e99c48fdaccd7bdc61bb4f3f2515ee6cfc" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "dpatposs" -> null
              - id           = "0948928f0870858bf04a47374e9461e99c48fdaccd7bdc61bb4f3f2515ee6cfc" -> null
            }
        }
    }

  # module.lambda_bucket.aws_s3_bucket_ownership_controls.this[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "this" {
      ~ bucket = "clash-bot-lambda-bucket-development" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "clash-bot-lambda-bucket-development" -> (known after apply)

      ~ rule {
          ~ object_ownership = "BucketOwnerEnforced" -> "ObjectWriter"
        }
    }

  # module.lambda_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "clash-bot-lambda-bucket-development" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "clash-bot-lambda-bucket-development" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_bucket.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "clash-bot-lambda-bucket-development" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "clash-bot-lambda-bucket-development" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  + s3_bucket_name   = (known after apply)
  + s3_bucket_policy = ""

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*